IDEA StatiCa Open Model
ConnectionCheckRes.CheckResConcreteBlock Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 List of check results for concrete blocks
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public List<CheckResConcreteBlock> CheckResConcreteBlock { get; set; }
Public Property CheckResConcreteBlock As List(Of CheckResConcreteBlock)
	Get
	Set
public:
property List<CheckResConcreteBlock^>^ CheckResConcreteBlock {
	List<CheckResConcreteBlock^>^ get ();
	void set (List<CheckResConcreteBlock^>^ value);
}
Property Value
Type: List<CheckResConcreteBlock>
See Also
Reference
ConnectionCheckRes Class
IdeaRS.OpenModel.Connection Namespace